SilentWolf75/Display-for-Tempest-Weather-Station/firmware/sdkconfig.defaults
# ---------------------------------------------------------------------------
# CrowPanel Advance 10.1" (ESP32-P4 + ESP32-C6) — project defaults
# Regenerate sdkconfig by deleting it and rebuilding; do not commit sdkconfig.
# ---------------------------------------------------------------------------

CONFIG_IDF_TARGET="esp32p4"

# --- OTA ---
# Roll back automatically if a freshly flashed image never marks itself valid.
# Without this a bad update means physically retrieving a wall-mounted panel.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# --- Flash / partitions ---
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
# The OTA-capable bootloader grew to within 256 bytes of the default 0x7000
# budget. Moving the partition table to 0xA000 gives it 0x9000 instead, which
# is cheap insurance -- overflowing it is a hard build failure with a cryptic
# message. Offsets in partitions.csv shift to match.
CONFIG_PARTITION_TABLE_OFFSET=0xA000
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- PSRAM: 32 MB, needed for the 1024x600 framebuffers ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096

# The 200 MHz PSRAM setting the Elecrow wiki calls for is gated behind this.
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# --- CPU ---
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_400=y

# --- Networking is proxied to the ESP32-C6 over SDIO (ESP-Hosted) ---
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
CONFIG_ESP_HOSTED=y
CONFIG_ESP_HOSTED_HOST=y

# UDP broadcast ingest: make sure LwIP is not the thing that drops our frames.
# The default UDP PCB / mbox sizes are tight for a 3-second rapid_wind stream
# sharing the stack with a TLS forecast poll.
CONFIG_LWIP_MAX_UDP_PCBS=16
CONFIG_LWIP_UDP_RECVMBOX_SIZE=16
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64
CONFIG_LWIP_SO_RCVBUF=y
CONFIG_LWIP_IP_FORWARD=n
CONFIG_LWIP_NETIF_LOOPBACK=y

# SNTP — needed for sunrise/sunset and "last updated" staleness.
CONFIG_LWIP_SNTP_MAX_SERVERS=2

# --- TLS for the REST forecast poll ---
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
CONFIG_ESP_TLS_INSECURE=n

# --- Main task needs room for LVGL setup ---
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# --- Logging: verbose while bringing the board up, drop to INFO later ---
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# --- Panic behaviour: print a backtrace instead of silently rebooting ---
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y

# --- LVGL: enable only the Montserrat sizes ui.c actually references ---
# Each font costs flash, so this list is the UI's font budget. Adding a size to
# ui.c without adding it here fails the build with "undeclared identifier".
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_34=y
CONFIG_LV_FONT_MONTSERRAT_38=y
CONFIG_LV_FONT_MONTSERRAT_46=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y

# LVGL colour depth must match the panel and the lvgl_port display config.
CONFIG_LV_COLOR_DEPTH_16=y

# Draw buffers live in PSRAM; LVGL needs to know it may use it.
CONFIG_LV_USE_PERF_MONITOR=n
CONFIG_LV_USE_MEM_MONITOR=n

# --- Animated Lottie weather icons via ThorVG ---
# lv_lottie needs the vector graphics pipeline plus a ThorVG backend.
# ThorVG is a C++ vector renderer; this is the single biggest optional cost in
# the build, which is why it is grouped and commented rather than sprinkled.
CONFIG_LV_USE_VECTOR_GRAPHIC=y
CONFIG_LV_USE_THORVG=y
CONFIG_LV_USE_THORVG_INTERNAL=y
CONFIG_LV_USE_LOTTIE=y
CONFIG_LV_USE_MATRIX=y

# --- SPIFFS: the icon partition ---
# Default object-name length is 32 chars, and paths like
# "/icons/possibly-thunderstorm-day.json" are 37. spiffsgen enforces this at
# build time, so a too-long slug fails the build rather than the device.
CONFIG_SPIFFS_OBJ_NAME_LEN=64
CONFIG_SPIFFS_PAGE_CHECK=y
